<?php


$articleText = "Microsoft совместно с Кембриджским Университетом разрабатывает программное обеспечение под названием DeepCoder. 
Встроенный искусственный интеллект умеет работать с описанием разрабатываемого ПО и искать подходящий код среди массивных баз данных с уже известными работающими строкам кода. 
DeepCoder словно сошёл со страниц научно-популярной фантастики минувших лет - имея всего лишь ряд требований, 
DeepCoder составляет собственный рабочий алгоритм всего за несколько секунд, буквально выдёргивая куски подходящего рабочего кода из имеющихся в открытом доступе баз данных.
Потенциал для автоматизации написания программного кода просто невероятен. 
Это означает сокращение огромного количества усилий, которое требуется для разработки кода,
- говорит Армандо Солар-Лезама из Массачусетского Технологического Института, который не принимал участия в работе. 
- Такая система будет гораздо продуктивнее любого человека. Кроме того, можно будет создавать системы, которые раньше было невозможно построить.
DeepCoder распознаёт, какие комбинации исходного кода работают, а какие нет, причём качество подбора частей кода улучшается с каждым разом.
DeepCoder создаёт рабочие программы за доли секунды, в то время как более старые системы тратят по несколько минут, перебирая и пробуя разные комбинации строчек кода до тех пор, пока одна из них не сработает.
Таким образом, разработка Microsoft представляет собой более умную и продвинутую платформу.";

echo $articleText;
